In [1]:
import pandas as pd
import glob
import mysql.connector
import urllib.request
from bs4 import BeautifulSoup
from selenium import webdriver
import time
import json
import urllib.parse
import requests
import re

In [2]:
from sqlalchemy import create_engine
engine = create_engine('mysql+mysqlconnector://root:123456@localhost:3306/sendo')

# BRAINSTORM

## DATA SPLIT 

data will be separated into 3 parts
- part-aa: Training data
- part-ab: validation data
- part-ac: test data

# Import user id

In [2]:
data_path = [
    "./data/part-aa_{}.csv",
    "./data/part-ab_{}.csv",
    "./data/part-ac_{}.csv",
]

In [19]:
data = pd.concat([pd.read_csv(f, usecols=["user_id"]) for f in glob.glob('./data/*.csv')], ignore_index = True).drop_duplicates()
data.reset_index(inplace=True, drop=True)

In [20]:
data.head(2)

                            user_id
0  7892FA71D8D1EAEBE438135718A5C420
1  2CEBC824EBEF1B52EA7562B716D020D8

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 799484 entries, 0 to 799483
Data columns (total 1 columns):
user_id    799484 non-null object
dtypes: object(1)
memory usage: 6.1+ MB

In [22]:
data.describe().T

          count  unique                               top freq
user_id  799484  799484  30F78682388DC9D416D43A765A9CD893    1

In [23]:
data.to_sql(con=engine, name='user', if_exists='replace', method="multi", index=True, index_label="id",chunksize=100, schema="sendo")

# Import category 1 id

In [89]:
data = pd.concat([pd.read_csv(f, usecols=["belong_cate_lvl1_id","belong_cate_lvl1_name"], encoding="utf8") for f in glob.glob('./data/*.csv')], ignore_index = True).drop_duplicates(["belong_cate_lvl1_id","belong_cate_lvl1_name"],keep="last")

In [90]:
data.columns = ["category_id", "name"]
data["parent_id"] = 0

In [91]:
data.sort_values(["category_id"])

         category_id                 name  parent_id
7104102            8        Thời trang nữ          0
7104097           94       Thời trang nam          0
7104094          138             Mẹ và bé          0
7104086          220   Sức khỏe & Làm đẹp          0
3571049          220              Mỹ phẩm          0
7104100          528   Phụ kiện công nghệ          0
7103776          604             Đời sống          0
6401005          604      Không gian sống          0
7104079          736  Thể thao & giải trí          0
7104048         1019              Nhà cửa          0
4686258         1019    Đồ dùng trong nhà          0
7104093         1108     Đồ điện gia dụng          0
7103533         1171            Thực phẩm          0
7104088         1366              Đồng hồ          0
7104004         1458              Đồ chơi          0
7104054         1629  Phụ kiện thời trang          0
7104081         1663            Công nghệ          0
7104101         1686             Giày dép          0
4340402         1686             Gi￠y d￩p          0
5712727         1722             T￺i x￡ch          0
7104087         1722             Túi xách          0

In [92]:
data = data.drop(axis="index", index=[3571049,6401005,4686258,4340402,5712727])

In [94]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 16 entries, 7103533 to 7104102
Data columns (total 3 columns):
category_id    16 non-null int64
name           16 non-null object
parent_id      16 non-null int64
dtypes: int64(2), object(1)
memory usage: 512.0+ bytes

In [95]:
data.describe(include="all").T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
category_id,16,NaN,NaN,NaN,946.875,620.353,8,451,1063.5,1500.75,1722
name,16,16,Đồ điện gia dụng,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
parent_id,16,NaN,NaN,NaN,0,0,0,0,0,0,0

In [96]:
data.to_sql(con=engine, name='category', if_exists='replace', method="multi", index=False, schema="sendo")

# Import category 2 id

In [97]:
data = pd.concat([pd.read_csv(f, usecols=["belong_cate_lvl1_id","belong_cate_lvl2_id","belong_cate_lvl2_name"], encoding="utf8") for f in glob.glob('./data/*.csv')], ignore_index = True).drop_duplicates(keep="last")

In [98]:
data=data[["belong_cate_lvl2_id","belong_cate_lvl2_name","belong_cate_lvl1_id",]]

In [99]:
data.columns = ["category_id", "name", "parent_id"]

In [100]:
data.sort_values(["category_id"]).drop_duplicates(["category_id"])

         category_id                  name  parent_id
7104102            9                 Áo nữ          8
7103838           18               Quần nữ          8
7104071           26              Đầm, váy          8
7104089           34              Chân váy          8
4137729           40          Dép, giày nữ          8
...              ...                   ...        ...
7102573         1898   Quần áo thể thao nữ          8
7103937         1910    Đồng hồ thông minh       1366
6927322         1918  Bộ mặc nhà, đồ ngủ            8
7084379         1925    Thiết bị chơi game        528
7104025         1938    Đồ mặc nhà, đồ ngủ          8

[145 rows x 3 columns]

In [101]:
data

         category_id                             name  parent_id
288149           762                 Thể dục thể hình        736
311195           759                Leo núi, cắm trại        736
385496          1534  Phụ kiện máy ảnh, máy quay phim        528
389767           530                Phụ kiện Máy tính        528
389769           529              Phụ kiện Điện thoại        528
...              ...                              ...        ...
7104097          673                     Áo khoác nam         94
7104099          695         Set trang phục, jumpsuit          8
7104100          530        Phụ kiện Máy tính, Laptop        528
7104101         1690                          Dép nam       1686
7104102            9                            Áo nữ          8

[163 rows x 3 columns]

In [102]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 163 entries, 288149 to 7104102
Data columns (total 3 columns):
category_id    163 non-null int64
name           163 non-null object
parent_id      163 non-null int64
dtypes: int64(2), object(1)
memory usage: 5.1+ KB

In [103]:
data.describe(include="all").T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
category_id,163,NaN,NaN,NaN,1016.99,615.001,9,529.5,1115,1544,1938
name,163,160,Phụ kiện,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
parent_id,163,NaN,NaN,NaN,701.656,605.203,8,138,528,1171,1722

In [104]:
data.sort_values(["category_id"]).drop_duplicates(["category_id"]).to_sql(con=engine, name='category', if_exists='append', method="multi", index=False, schema="sendo")

# Import category 2 id

In [97]:
data = pd.concat([pd.read_csv(f, usecols=["belong_cate_lvl1_id","belong_cate_lvl2_id","belong_cate_lvl2_name"], encoding="utf8") for f in glob.glob('./data/*.csv')], ignore_index = True).drop_duplicates(keep="last")

In [98]:
data=data[["belong_cate_lvl2_id","belong_cate_lvl2_name","belong_cate_lvl1_id",]]

In [99]:
data.columns = ["category_id", "name", "parent_id"]

In [100]:
data.sort_values(["category_id"]).drop_duplicates(["category_id"])

         category_id                  name  parent_id
7104102            9                 Áo nữ          8
7103838           18               Quần nữ          8
7104071           26              Đầm, váy          8
7104089           34              Chân váy          8
4137729           40          Dép, giày nữ          8
...              ...                   ...        ...
7102573         1898   Quần áo thể thao nữ          8
7103937         1910    Đồng hồ thông minh       1366
6927322         1918  Bộ mặc nhà, đồ ngủ            8
7084379         1925    Thiết bị chơi game        528
7104025         1938    Đồ mặc nhà, đồ ngủ          8

[145 rows x 3 columns]

In [101]:
data

         category_id                             name  parent_id
288149           762                 Thể dục thể hình        736
311195           759                Leo núi, cắm trại        736
385496          1534  Phụ kiện máy ảnh, máy quay phim        528
389767           530                Phụ kiện Máy tính        528
389769           529              Phụ kiện Điện thoại        528
...              ...                              ...        ...
7104097          673                     Áo khoác nam         94
7104099          695         Set trang phục, jumpsuit          8
7104100          530        Phụ kiện Máy tính, Laptop        528
7104101         1690                          Dép nam       1686
7104102            9                            Áo nữ          8

[163 rows x 3 columns]

In [102]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 163 entries, 288149 to 7104102
Data columns (total 3 columns):
category_id    163 non-null int64
name           163 non-null object
parent_id      163 non-null int64
dtypes: int64(2), object(1)
memory usage: 5.1+ KB

In [103]:
data.describe(include="all").T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
category_id,163,NaN,NaN,NaN,1016.99,615.001,9,529.5,1115,1544,1938
name,163,160,Phụ kiện,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
parent_id,163,NaN,NaN,NaN,701.656,605.203,8,138,528,1171,1722

In [104]:
data.sort_values(["category_id"]).drop_duplicates(["category_id"]).to_sql(con=engine, name='category', if_exists='append', method="multi", index=False, schema="sendo")

# Import product

In [26]:
product_names=json.load(open("data/docs/product_name_mapping.json","r"))

In [27]:
data = pd.concat([pd.read_csv(f, usecols=["product_id","belong_cate_lvl1_id","belong_cate_lvl2_id","belong_cate_lvl3_id","href"], encoding="utf8") for f in glob.glob('./data/*.csv')], ignore_index = True).drop_duplicates(["product_id","belong_cate_lvl3_id","href"],keep="last")

In [28]:
data = data.drop_duplicates(["product_id","belong_cate_lvl3_id"]).sort_values(["product_id"])
data["name"] = data.product_id.apply(lambda x: product_names[str(x)].replace("-"," "))

In [29]:
data.columns = ['product_id', 'cate_lvl1_id', 'cate_lvl2_id', 'cate_lvl3_id', 'href', 'name']

In [30]:
data

,product_id,cate_lvl1_id,cate_lvl2_id,cate_lvl3_id,href,name
3008114,208,94,1670,1672,https://www.sendo.vn/san-pham/quan-jean-nam-th...,quan jean nam thoi trang 2noshop pa16
7103865,265,220,263,265,https://www.sendo.vn/san-pham/son-thoi-mac-287...,son thoi mac 2877696
6475271,2030,220,229,317,https://www.sendo.vn/san-pham/xa-bong-latte-co...,xa bong latte coffee
2419681,8395,1686,1689,1784,https://www.sendo.vn/san-pham/yeah1-giay-nike-...,yeah1 giay nike dunk superman moi ve hang
6685723,8422,1722,1804,1805,https://www.sendo.vn/san-pham/yeah1-tui-vans-8...,yeah1 tui vans
...,...,...,...,...,...,...
7102129,3414550,1722,1804,1806,https://www.sendo.vn/san-pham/balo-thoi-trang-...,balo thoi trang nu rubita
7104087,3414655,1722,1723,1732,https://www.sendo.vn/san-pham/tui-xach-balo-nu...,tui xach balo nu
7103844,3414693,94,1666,1667,https://www.sendo.vn/san-pham/so-mi-soc-tay-va...,so mi soc tay vai ms 2155
7104029,3414706,94,1666,1667,https://www.sendo.vn/san-pham/so-mi-soc-tay-va...,so mi soc tay vai ms 21551
7103773,3414764,528,529,536,https://www.sendo.vn/san-pham/cap-otg-cho-andr...,cap otg cho android

In [31]:
data.reset_index(inplace=True, drop=True)

In [32]:
data.to_sql(con=engine, name='product', if_exists='replace', method="multi", chunksize=100, index=True, index_label="id", schema="sendo")

# Import views id

In [33]:
data = pd.concat([pd.read_csv(f, usecols=["time","user_id","product_id","belong_cate_lvl3_id"]) for f in glob.glob('./data/*.csv')], ignore_index = True).drop_duplicates()

In [34]:
data.head(2)

,time,user_id,product_id,belong_cate_lvl3_id
0,2016-03-31 00:00:00,7892FA71D8D1EAEBE438135718A5C420,2920660,11
1,2016-03-31 00:00:06,2CEBC824EBEF1B52EA7562B716D020D8,1885579,1748

In [35]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7094764 entries, 0 to 7104102
Data columns (total 4 columns):
time                   object
user_id                object
product_id             int64
belong_cate_lvl3_id    int64
dtypes: int64(2), object(2)
memory usage: 270.6+ MB

In [36]:
data.describe().T

,count,mean,std,min,25%,50%,75%,max
product_id,7094764.0,2.645229e+06,574372.475509,208.0,2405522.0,2837857.0,3032601.0,3414764.0
belong_cate_lvl3_id,7094764.0,9.314821e+02,652.293803,10.0,252.0,734.0,1510.0,1945.0

In [37]:
data.reset_index(inplace=True, drop=True)

In [38]:
data.to_sql(con=engine, name='event', if_exists='replace', method="multi", index=True, index_label="id", chunksize=100, schema="sendo")